# Сумма чисел
Вычислить сумму вещественных чисел из заданного файла.

Имя входного файла с данными задано в командной строке. 

Ответ (сумму чисел) вывести в консоль.

## Формат входного файла
В первой строке файла содержится натуральное число N – количество вещественных чисел.

Далее в файле записаны N вещественных чисел.

## Вывод
Вывести вещественное число (сумму чисел) в консоль. Выводить в научном формате. Пример вывода:

```
	std::cout << std::scientific << std::setprecision(std::numeric_limits<double>::max_digits10) << ans << "\n";
```

## Требования к реализации
Программа не должна использовать контейнеры STL (std::vector, std::string и т. д.). 
